## Inserting

In [1]:
import pandas as pd

In [7]:
var = pd.DataFrame({"A":[1,2,3,4,5,6],"B":[6,7,8,9,0,5]})

var

   A  B
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0
5  6  5

In [ ]:
var.insert(2,"python1",var["A"])  ## Three parameter (index,coloum name,data)
var

In [17]:
var_1 = pd.DataFrame({"A":[1,2,3,4,5,6],"B":[6,7,8,9,0,5]})
var_1

   A  B
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0
5  6  5

In [18]:
var_1["Python_123"] = var_1["A"][:3]
var_1

   A  B  Python_123
0  1  6         1.0
1  2  7         2.0
2  3  8         3.0
3  4  9         NaN
4  5  0         NaN
5  6  5         NaN

## Delete

In [ ]:
var2 = var_1.pop("B")   ## Deleting Coloum using pop function
var2

In [22]:
var_1

   A  Python_123
0  1         1.0
1  2         2.0
2  3         3.0
3  4         NaN
4  5         NaN
5  6         NaN

In [ ]:
del var_1["A"]      ## deleting Data using Del function

In [29]:
var_1

   Python_123
0         1.0
1         2.0
2         3.0
3         NaN
4         NaN
5         NaN

In [30]:
var

   A  B  python1  python
0  1  6        1       1
1  2  7        2       2
2  3  8        3       3
3  4  9        4       4
4  5  0        5       5
5  6  5        6       6